{
    "title": "The Jedi's Journey",
    "start": "start",
    "nodes": {
        "start": {
            "text": "You stand at the edge of the Jedi Temple on Coruscant, gazing out at the bustling city-planet below. You've just been knighted as a Jedi, but the galaxy is at war, and your path forward is uncertain. What will you do?",
            "choices": [
                {
                    "text": "Join the Republic forces in the Clone Wars.",
                    "go_to": "join_war"
                },
                {
                    "text": "Investigate a disturbance in the Force.",
                    "go_to": "investigate_force"
                },
                {
                    "text": "Seek guidance from the Jedi Council.",
                    "go_to": "seek_guidance"
                }
            ]
        },
        "join_war": {
            "text": "You join the Republic forces, leading a battalion of clone troopers into battle. After a hard-fought victory, you sense something dark brewing. Do you...",
            "choices": [
                {
                    "text": "Pursue the source of the disturbance.",
                    "go_to": "dark_disturbance"
                },
                {
                    "text": "Return to the Jedi Temple for reinforcements.",
                    "go_to": "temple_return"
                }
            ]
        },
        "investigate_force": {
            "text": "You follow the ripples of the Force to a remote planet. There, you uncover an ancient Sith artifact radiating dark energy. Do you...",
            "choices": [
                {
                    "text": "Attempt to destroy the artifact.",
                    "go_to": "destroy_artifact"
                },
                {
                    "text": "Bring the artifact back to the Jedi Temple for study.",
                    "go_to": "artifact_study"
                }
            ]
        },
        "seek_guidance": {
            "text": "The Jedi Council advises caution and assigns you to investigate rumors of a hidden Sith lord. Your search leads you to an abandoned starship. Do you...",
            "choices": [
                {
                    "text": "Board the starship to search for clues.",
                    "go_to": "starship_clues"
                },
                {
                    "text": "Set a trap to lure the Sith out of hiding.",
                    "go_to": "sith_trap"
                }
            ]
        },
        "dark_disturbance": {
            "text": "You track the disturbance to a Separatist base. Inside, you find evidence of a Sith manipulating both sides of the war. You report this to the Council. **Congratulations, you've uncovered a critical truth!**"
        },
        "temple_return": {
            "text": "Back at the Jedi Temple, you share your findings. The Council acknowledges your wisdom in seeking help, and together, you prepare a decisive plan. **Congratulations, you've strengthened the Jedi Order!**"
        },
        "destroy_artifact": {
            "text": "You channel all your strength into destroying the Sith artifact. The process is dangerous, but you succeed. The dark energy dissipates. **Congratulations, you've vanquished a great evil!**"
        },
        "artifact_study": {
            "text": "You bring the artifact to the Temple, where the Council studies its secrets. Your decision provides valuable insights into the Sith. **Congratulations, you've advanced the knowledge of the Jedi!**"
        },
        "starship_clues": {
            "text": "On the starship, you discover a Sith holocron containing critical information. Using the knowledge, you thwart a Sith plot. **Congratulations, you've protected the galaxy!**"
        },
        "sith_trap": {
            "text": "Your trap works, and the Sith lord reveals themselves. After an intense duel, you emerge victorious. **Congratulations, you've defeated a powerful enemy of the Republic!**"
        }
    }
}